app/controllers/completions_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "todos" SET "updated_at" = '2012-07-16 21:14:59.574261', "completed_at" = '2012-07-16 21:14:59.574261' WHERE "todos"."id" = 1
---
	def create
		todo = Todo.find(params[:todo_id])
		todo.touch :completed_at