app/controllers/todos_controller.rb

	def create
		todo = Todo.new(params[:todo])
		todo.user = current_user
		todo.save
---
INSERT INTO "todos" ("completed_at", "created_at", "description", "owner_email", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed_at", nil], ["created_at", Mon, 16 Jul 2012 21:01:42 UTC +00:00], ["description", "Buy milk"], ["owner_email", "john@example.com"], ["updated_at", Mon, 16 Jul 2012 21:01:42 UTC +00:00]]